<script setup lang="ts">
import { version } from '../../package.json'
</script>
<template>
  <p>✨ Список изменений:</p>
  <ul v-if="version === '1.0.0-beta.5.1'" class="list-disc ml-12 mt-2">
    <li>Исправлена ошибка с авторизацией сотрудников, созданных через интерфейс приложения.</li>
    <li>
      В профиле товаров добавлены разделы "Упаковки и цены", "Штрих-коды", "Характеристики", "Сайт".
    </li>
    <li>В ценниках теперь указывается страна-производитель.</li>
    <li>Изменен формат отображения номера в накладных.</li>
    <li>Добавлены новые параметры фильтрации для истории накладных.</li>
    <li>Изменен редактор накладных добавлен выбор упаковоки (ед. изм.).</li>
    <li>Добавлена возможность создания скидки в расходной накладной.</li>
    <li>Добавлен выбор шаблона комментария для накладной.</li>
    <li>Теперь все боковые панели можно изменять по ширине.</li>
    <li>Добавлен раздел "Сотрудники".</li>
    <li>Добавлена возможность создавать новых сотрудников.</li>
    <li>Добавлена система ролей для сотрудников.</li>
    <li>В таблицу товаров добавлен столбец базовой ед. изм.</li>
    <li>Улучшена прозводительность при работе с таблицами.</li>
    <li>Изменена панель настроек.</li>
    <li>Добавлена панель "Аналитика".</li>
    <li>Список складов теперь помещается полностью.</li>
    <li>Добавлены подсказки при работе с системой.</li>
    <li>Удалена панель помощи.</li>
  </ul>
  <ul v-else class="list-disc ml-12 mt-2">
    <li>Улучшение производительности.</li>
    <li>Исправление незначительных ошибок.</li>
  </ul>
</template>
